; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v2)
		(pred_1 ?v8)
		(pred_3 ?v3)
		(pred_2 ?v3)
		(pred_6 ?v8 ?v3)
		(pred_5)
		(pred_4 ?v8))

   (:action op_1
       :parameters  (?v7 ?v6)
       :precondition (and (not-eq ?v7 ?v6) 
                          (pred_3 ?v7) (pred_3 ?v6) (pred_2 ?v7))
       :effect (and  (pred_2 ?v6)
		     (not (pred_2 ?v7))))


   (:action op_3
       :parameters (?v5 ?v4)
       :precondition  (and  (pred_1 ?v5) (pred_3 ?v4)
			    (pred_6 ?v5 ?v4) (pred_2 ?v4) (pred_5))
       :effect (and (pred_4 ?v5)
		    (not (pred_6 ?v5 ?v4)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v5  ?v4)
       :precondition  (and  (pred_1 ?v5) (pred_3 ?v4)
			    (pred_4 ?v5) (pred_2 ?v4))
       :effect (and (pred_6 ?v5 ?v4)
		    (pred_5)
		    (not (pred_4 ?v5)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_05 obj_01 obj_08 obj_07 obj_09 obj_06 
          obj_03 obj_02 obj_04 
)
(:init
(pred_3 obj_05)
(pred_3 obj_01)
(pred_3 obj_08)
(pred_3 obj_07)
(pred_3 obj_09)
(pred_3 obj_06)
(pred_1 obj_03)
(pred_1 obj_02)
(pred_1 obj_04)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_09)
(not-eq obj_09 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_09)
(not-eq obj_09 obj_01)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_09)
(not-eq obj_09 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_07 obj_09)
(not-eq obj_09 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_09 obj_06)
(not-eq obj_06 obj_09)
(pred_5)
(pred_6 obj_03 obj_06)
(pred_6 obj_02 obj_05)
(pred_6 obj_04 obj_06)
(pred_2 obj_05)
)
(:goal
(and
(pred_6 obj_03 obj_05)
(pred_6 obj_02 obj_01)
(pred_6 obj_04 obj_09)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_03 obj_05) (pred_2 obj_01))
    (sometime-before  (pred_6 obj_02 obj_01) (pred_2 obj_08))
    (sometime-before  (pred_6 obj_04 obj_09) (pred_2 obj_01))
  )
)
)

; plan
1. (op_1 obj_05 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_06)
   goals met: 0 of 3
2. (op_3 obj_04 obj_06)
   deleted: (pred_6 obj_04 obj_06) (pred_5)
   added: (pred_4 obj_04)
   goals met: 0 of 3
3. (op_1 obj_06 obj_05)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_05)
   goals met: 0 of 3
4. (op_2 obj_04 obj_05)
   deleted: (pred_4 obj_04)
   added: (pred_6 obj_04 obj_05) (pred_5)
   goals met: 0 of 3
5. (op_1 obj_05 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_06)
   goals met: 0 of 3
6. (op_3 obj_03 obj_06)
   deleted: (pred_6 obj_03 obj_06) (pred_5)
   added: (pred_4 obj_03)
   goals met: 0 of 3
7. (op_1 obj_06 obj_08)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_08)
   goals met: 0 of 3
8. (op_2 obj_03 obj_08)
   deleted: (pred_4 obj_03)
   added: (pred_6 obj_03 obj_08) (pred_5)
   goals met: 0 of 3
9. (op_1 obj_08 obj_05)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_05)
   goals met: 0 of 3
10. (op_3 obj_02 obj_05)
   deleted: (pred_6 obj_02 obj_05) (pred_5)
   added: (pred_4 obj_02)
   goals met: 0 of 3
11. (op_1 obj_05 obj_01)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_01)
   goals met: 0 of 3
12. (op_2 obj_02 obj_01)
   deleted: (pred_4 obj_02)
   added: (pred_6 obj_02 obj_01) (pred_5)
   goals met: 1 of 3
13. (op_1 obj_01 obj_05)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_05)
   goals met: 1 of 3
14. (op_3 obj_04 obj_05)
   deleted: (pred_6 obj_04 obj_05) (pred_5)
   added: (pred_4 obj_04)
   goals met: 1 of 3
15. (op_1 obj_05 obj_09)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_09)
   goals met: 1 of 3
16. (op_2 obj_04 obj_09)
   deleted: (pred_4 obj_04)
   added: (pred_6 obj_04 obj_09) (pred_5)
   goals met: 2 of 3
17. (op_1 obj_09 obj_08)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_08)
   goals met: 2 of 3
18. (op_3 obj_03 obj_08)
   deleted: (pred_6 obj_03 obj_08) (pred_5)
   added: (pred_4 obj_03)
   goals met: 2 of 3
19. (op_1 obj_08 obj_05)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_05)
   goals met: 2 of 3
20. (op_2 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_6 obj_03 obj_05) (pred_5)
   goals met: 3 of 3
